#### Terraform Plan 📋

<details><summary>Show Plan</summary>

```
random_id.bucket_suffix: Refreshing state... [id=6NXj9w]
aws_iam_openid_connect_provider.github_actions: Refreshing state... [id=arn:aws:iam::621218322544:oidc-provider/token.actions.githubusercontent.com]
data.aws_ami.amazon_linux_x86: Reading...
data.aws_ami.amazon_linux_x86_nat: Reading...
aws_vpc.main: Refreshing state... [id=vpc-03ac57bd55e6150fd]
aws_s3_bucket.terraform_state: Refreshing state... [id=rsschool-devops-terraform-lordofthevillage-e8d5e3f7]
data.aws_ami.k3s_nodes: Reading...
data.aws_iam_policy_document.github_actions_assume_role: Reading...
data.aws_iam_policy_document.github_actions_assume_role: Read complete after 0s [id=2301905863]
aws_iam_role.github_actions_role: Refreshing state... [id=GithubActionsRole]
aws_iam_role_policy_attachment.github_actions_ec2: Refreshing state... [id=GithubActionsRole-20250611082319393100000002]
aws_iam_role_policy_attachment.github_actions_eventbridge: Refreshing state... [id=GithubActionsRole-20250611082319187100000001]
aws_iam_role_policy_attachment.github_actions_vpc: Refreshing state... [id=GithubActionsRole-20250611082319541400000003]
aws_iam_role_policy_attachment.github_actions_iam: Refreshing state... [id=GithubActionsRole-20250611082319568300000005]
aws_iam_role_policy_attachment.github_actions_route53: Refreshing state... [id=GithubActionsRole-20250611082319581700000006]
aws_iam_role_policy_attachment.github_actions_s3: Refreshing state... [id=GithubActionsRole-20250611082319555700000004]
aws_iam_role_policy_attachment.github_actions_sqs: Refreshing state... [id=GithubActionsRole-20250611082319586400000007]
data.aws_ami.amazon_linux_x86: Read complete after 1s [id=ami-0efdd6dbd49057e5b]
data.aws_ami.amazon_linux_x86_nat: Read complete after 1s [id=ami-0efdd6dbd49057e5b]
data.aws_ami.k3s_nodes: Read complete after 1s [id=ami-0efdd6dbd49057e5b]
aws_subnet.private[0]: Refreshing state... [id=subnet-09b742eee03db3f42]
aws_subnet.private[1]: Refreshing state... [id=subnet-0f1ed704901363804]
aws_internet_gateway.main: Refreshing state... [id=igw-0cdd002ca839176dd]
aws_route_table.private[0]: Refreshing state... [id=rtb-06bf45cf8d53cce1f]
aws_subnet.public[1]: Refreshing state... [id=subnet-0b010b4ff11ba6546]
aws_route_table.private[1]: Refreshing state... [id=rtb-003958f3ddb40ba6a]
aws_subnet.public[0]: Refreshing state... [id=subnet-0c300f4bb0e6f27ca]
aws_security_group.bastion: Refreshing state... [id=sg-0fec5b4cd73af2623]
aws_eip.bastion: Refreshing state... [id=eipalloc-0bb0f8b2232d0755d]
aws_route_table.public: Refreshing state... [id=rtb-034829311a70ba3e7]
aws_eip.nat_instance: Refreshing state... [id=eipalloc-0117e0996b38e6e37]
aws_network_acl.private: Refreshing state... [id=acl-08eb00cb038bc16fc]
aws_s3_bucket_server_side_encryption_configuration.terraform_state: Refreshing state... [id=rsschool-devops-terraform-lordofthevillage-e8d5e3f7]
aws_s3_bucket_public_access_block.terraform_state: Refreshing state... [id=rsschool-devops-terraform-lordofthevillage-e8d5e3f7]
aws_s3_bucket_versioning.terraform_state: Refreshing state... [id=rsschool-devops-terraform-lordofthevillage-e8d5e3f7]
aws_security_group.nat_instance: Refreshing state... [id=sg-0b2be12c116f0d4a0]
aws_security_group.private_instances: Refreshing state... [id=sg-0278d9da6609bc0fb]
aws_instance.bastion: Refreshing state... [id=i-0348b941f375b8b68]
aws_network_acl.public: Refreshing state... [id=acl-06c44615ada3eb667]
aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-048ff16721bb304df]
aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-00826070b8ddefaf1]
aws_instance.nat_instance: Refreshing state... [id=i-0ae1675a6d7b86b29]
aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-0304abafb640a46f7]
aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-076d227efc00caff5]
aws_eip_association.bastion: Refreshing state... [id=eipassoc-00b40bd111da99446]
aws_eip_association.nat_instance: Refreshing state... [id=eipassoc-012ea2915d9f10937]
aws_route.private_nat[1]: Refreshing state... [id=r-rtb-003958f3ddb40ba6a1080289494]
aws_route.private_nat[0]: Refreshing state... [id=r-rtb-06bf45cf8d53cce1f1080289494]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement
+/- create replacement and then destroy

Terraform will perform the following actions:

  # aws_eip.bastion will be updated in-place
  ~ resource "aws_eip" "bastion" {
        id                       = "eipalloc-0bb0f8b2232d0755d"
      ~ tags                     = {
            "Environment" = "dev"
            "ManagedBy"   = "terraform"
            "Name"        = "rsschool-devops-bastion-eip"
            "Project"     = "rsschool-devops"
          - "Task"        = "task_2" -> null
        }
      ~ tags_all                 = {
          - "Task"        = "task_2" -> null
            # (4 unchanged elements hidden)
        }
        # (17 unchanged attributes hidden)
    }

  # aws_eip.nat_instance will be updated in-place
  ~ resource "aws_eip" "nat_instance" {
        id                       = "eipalloc-0117e0996b38e6e37"
      ~ tags                     = {
            "Environment" = "dev"
            "ManagedBy"   = "terraform"
            "Name"        = "rsschool-devops-nat-eip"
            "Project"     = "rsschool-devops"
          - "Task"        = "task_2" -> null
        }
      ~ tags_all                 = {
          - "Task"        = "task_2" -> null
            # (4 unchanged elements hidden)
        }
        # (17 unchanged attributes hidden)
    }

  # aws_eip_association.bastion must be replaced
-/+ resource "aws_eip_association" "bastion" {
      ~ id                   = "eipassoc-00b40bd111da99446" -> (known after apply)
      ~ instance_id          = "i-0348b941f375b8b68" -> (known after apply) # forces replacement
      ~ network_interface_id = "eni-0fa732096e7672f80" -> (known after apply)
      ~ private_ip_address   = "10.0.1.85" -> (known after apply)
      ~ public_ip            = "3.11.133.167" -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # aws_eip_association.nat_instance must be replaced
-/+ resource "aws_eip_association" "nat_instance" {
      ~ id                   = "eipassoc-012ea2915d9f10937" -> (known after apply)
      ~ instance_id          = "i-0ae1675a6d7b86b29" -> (known after apply) # forces replacement
      ~ network_interface_id = "eni-06c0e462f4985c7e4" -> (known after apply)
      ~ private_ip_address   = "10.0.1.6" -> (known after apply)
      ~ public_ip            = "18.171.106.21" -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # aws_iam_instance_profile.k3s_node_profile will be created
  + resource "aws_iam_instance_profile" "k3s_node_profile" {
      + arn         = (known after apply)
      + create_date = (known after apply)
      + id          = (known after apply)
      + name        = "rsschool-devops-k3s-node-profile"
      + name_prefix = (known after apply)
      + path        = "/"
      + role        = "rsschool-devops-k3s-node-role"
      + tags        = {
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Name"        = "rsschool-devops-k3s-node-profile"
          + "Project"     = "rsschool-devops"
        }
      + tags_all    = {
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Name"        = "rsschool-devops-k3s-node-profile"
          + "Project"     = "rsschool-devops"
        }
      + unique_id   = (known after apply)
    }

  # aws_iam_role.k3s_node_role will be created
  + resource "aws_iam_role" "k3s_node_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ec2.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "rsschool-devops-k3s-node-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Name"        = "rsschool-devops-k3s-node-role"
          + "Project"     = "rsschool-devops"
        }
      + tags_all              = {
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Name"        = "rsschool-devops-k3s-node-role"
          + "Project"     = "rsschool-devops"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # aws_iam_role_policy.k3s_node_ssm_policy will be created
  + resource "aws_iam_role_policy" "k3s_node_ssm_policy" {
      + id          = (known after apply)
      + name        = "rsschool-devops-k3s-node-ssm-policy"
      + name_prefix = (known after apply)
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "ssm:GetParameter",
                          + "ssm:PutParameter",
                          + "ssm:GetParameters",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:ssm:eu-west-2:*:parameter/k3s/*",
                        ]
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + role        = (known after apply)
    }

  # aws_instance.bastion must be replaced
+/- resource "aws_instance" "bastion" {
      ~ ami                                  = "ami-0a3f61f21fa449cda" -> "ami-0efdd6dbd49057e5b" # forces replacement
      ~ arn                                  = "arn:aws:ec2:eu-west-2:621218322544:instance/i-0348b941f375b8b68" -> (known after apply)
      ~ associate_public_ip_address          = true -> (known after apply)
      ~ availability_zone                    = "eu-west-2a" -> (known after apply)
      ~ cpu_core_count                       = 1 -> (known after apply)
      ~ cpu_threads_per_core                 = 1 -> (known after apply)
      ~ disable_api_stop                     = false -> (known after apply)
      ~ disable_api_termination              = false -> (known after apply)
      ~ ebs_optimized                        = false -> (known after apply)
      + enable_primary_ipv6                  = (known after apply)
      - hibernation                          = false -> null
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      + iam_instance_profile                 = (known after apply)
      ~ id                                   = "i-0348b941f375b8b68" -> (known after apply)
      ~ instance_initiated_shutdown_behavior = "stop" -> (known after apply)
      + instance_lifecycle                   = (known after apply)
      ~ instance_state                       = "running" -> (known after apply)
      ~ ipv6_address_count                   = 0 -> (known after apply)
      ~ ipv6_addresses                       = [] -> (known after apply)
      ~ monitoring                           = false -> (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      ~ placement_partition_number           = 0 -> (known after apply)
      ~ primary_network_interface_id         = "eni-0fa732096e7672f80" -> (known after apply)
      ~ private_dns                          = "ip-10-0-1-85.eu-west-2.compute.internal" -> (known after apply)
      ~ private_ip                           = "10.0.1.85" -> (known after apply)
      ~ public_dns                           = "ec2-3-11-133-167.eu-west-2.compute.amazonaws.com" -> (known after apply)
      ~ public_ip                            = "3.11.133.167" -> (known after apply)
      ~ secondary_private_ips                = [] -> (known after apply)
      ~ security_groups                      = [] -> (known after apply)
      + spot_instance_request_id             = (known after apply)
      ~ tags                                 = {
            "Environment" = "dev"
            "ManagedBy"   = "terraform"
            "Name"        = "rsschool-devops-bastion-host"
            "Project"     = "rsschool-devops"
          - "Task"        = "task_2" -> null
            "Type"        = "bastion"
        }
      ~ tags_all                             = {
          - "Task"        = "task_2" -> null
            # (5 unchanged elements hidden)
        }
      ~ tenancy                              = "default" -> (known after apply)
      ~ user_data                            = "5bb952cba9897eb14ae12d429f882943554e7dfb" -> "9dda043c982a2c2c19160bf9b1ddfaf59ec834f1"
      + user_data_base64                     = (known after apply)
        # (7 unchanged attributes hidden)

      ~ capacity_reservation_specification (known after apply)
      - capacity_reservation_specification {
          - capacity_reservation_preference = "open" -> null
        }

      ~ cpu_options (known after apply)
      - cpu_options {
          - core_count       = 1 -> null
          - threads_per_core = 1 -> null
            # (1 unchanged attribute hidden)
        }

      - credit_specification {
          - cpu_credits = "standard" -> null
        }

      ~ ebs_block_device (known after apply)

      ~ enclave_options (known after apply)
      - enclave_options {
          - enabled = false -> null
        }

      ~ ephemeral_block_device (known after apply)

      ~ instance_market_options (known after apply)

      ~ maintenance_options (known after apply)
      - maintenance_options {
          - auto_recovery = "default" -> null
        }

      ~ metadata_options (known after apply)
      - metadata_options {
          - http_endpoint               = "enabled" -> null
          - http_protocol_ipv6          = "disabled" -> null
          - http_put_response_hop_limit = 2 -> null
          - http_tokens                 = "required" -> null
          - instance_metadata_tags      = "disabled" -> null
        }

      ~ network_interface (known after apply)

      ~ private_dns_name_options (known after apply)
      - private_dns_name_options {
          - enable_resource_name_dns_a_record    = false -> null
          - enable_resource_name_dns_aaaa_record = false -> null
          - hostname_type                        = "ip-name" -> null
        }

      ~ root_block_device (known after apply)
      - root_block_device {
          - delete_on_termination = true -> null
          - device_name           = "/dev/xvda" -> null
          - encrypted             = false -> null
          - iops                  = 3000 -> null
          - tags                  = {} -> null
          - tags_all              = {} -> null
          - throughput            = 125 -> null
          - volume_id             = "vol-0d0c3e0a309236940" -> null
          - volume_size           = 30 -> null
          - volume_type           = "gp3" -> null
            # (1 unchanged attribute hidden)
        }
    }

  # aws_instance.k3s_master will be created
  + resource "aws_instance" "k3s_master" {
      + ami                                  = "ami-0efdd6dbd49057e5b"
      + arn                                  = (known after apply)
      + associate_public_ip_address          = (known after apply)
      + availability_zone                    = (known after apply)
      + cpu_core_count                       = (known after apply)
      + cpu_threads_per_core                 = (known after apply)
      + disable_api_stop                     = (known after apply)
      + disable_api_termination              = (known after apply)
      + ebs_optimized                        = (known after apply)
      + enable_primary_ipv6                  = (known after apply)
      + get_password_data                    = false
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      + iam_instance_profile                 = "rsschool-devops-k3s-node-profile"
      + id                                   = (known after apply)
      + instance_initiated_shutdown_behavior = (known after apply)
      + instance_lifecycle                   = (known after apply)
      + instance_state                       = (known after apply)
      + instance_type                        = "t2.micro"
      + ipv6_address_count                   = (known after apply)
      + ipv6_addresses                       = (known after apply)
      + key_name                             = "rsschool-devops-key"
      + monitoring                           = (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + placement_partition_number           = (known after apply)
      + primary_network_interface_id         = (known after apply)
      + private_dns                          = (known after apply)
      + private_ip                           = (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      + secondary_private_ips                = (known after apply)
      + security_groups                      = (known after apply)
      + source_dest_check                    = true
      + spot_instance_request_id             = (known after apply)
      + subnet_id                            = "subnet-09b742eee03db3f42"
      + tags                                 = {
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Name"        = "rsschool-devops-k3s-master"
          + "Project"     = "rsschool-devops"
          + "Task"        = "task_3"
          + "Type"        = "k3s-master"
        }
      + tags_all                             = {
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Name"        = "rsschool-devops-k3s-master"
          + "Project"     = "rsschool-devops"
          + "Task"        = "task_3"
          + "Type"        = "k3s-master"
        }
      + tenancy                              = (known after apply)
      + user_data                            = "d0e80955f7682cf868eceb2c697ced65d756ba75"
      + user_data_base64                     = (known after apply)
      + user_data_replace_on_change          = false
      + vpc_security_group_ids               = (known after apply)

      + capacity_reservation_specification (known after apply)

      + cpu_options (known after apply)

      + ebs_block_device (known after apply)

      + enclave_options (known after apply)

      + ephemeral_block_device (known after apply)

      + instance_market_options (known after apply)

      + maintenance_options (known after apply)

      + metadata_options (known after apply)

      + network_interface (known after apply)

      + private_dns_name_options (known after apply)

      + root_block_device (known after apply)
    }

  # aws_instance.k3s_worker will be created
  + resource "aws_instance" "k3s_worker" {
      + ami                                  = "ami-0efdd6dbd49057e5b"
      + arn                                  = (known after apply)
      + associate_public_ip_address          = (known after apply)
      + availability_zone                    = (known after apply)
      + cpu_core_count                       = (known after apply)
      + cpu_threads_per_core                 = (known after apply)
      + disable_api_stop                     = (known after apply)
      + disable_api_termination              = (known after apply)
      + ebs_optimized                        = (known after apply)
      + enable_primary_ipv6                  = (known after apply)
      + get_password_data                    = false
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      + iam_instance_profile                 = "rsschool-devops-k3s-node-profile"
      + id                                   = (known after apply)
      + instance_initiated_shutdown_behavior = (known after apply)
      + instance_lifecycle                   = (known after apply)
      + instance_state                       = (known after apply)
      + instance_type                        = "t2.micro"
      + ipv6_address_count                   = (known after apply)
      + ipv6_addresses                       = (known after apply)
      + key_name                             = "rsschool-devops-key"
      + monitoring                           = (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + placement_partition_number           = (known after apply)
      + primary_network_interface_id         = (known after apply)
      + private_dns                          = (known after apply)
      + private_ip                           = (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      + secondary_private_ips                = (known after apply)
      + security_groups                      = (known after apply)
      + source_dest_check                    = true
      + spot_instance_request_id             = (known after apply)
      + subnet_id                            = "subnet-0f1ed704901363804"
      + tags                                 = {
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Name"        = "rsschool-devops-k3s-worker"
          + "Project"     = "rsschool-devops"
          + "Task"        = "task_3"
          + "Type"        = "k3s-worker"
        }
      + tags_all                             = {
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Name"        = "rsschool-devops-k3s-worker"
          + "Project"     = "rsschool-devops"
          + "Task"        = "task_3"
          + "Type"        = "k3s-worker"
        }
      + tenancy                              = (known after apply)
      + user_data                            = (known after apply)
      + user_data_base64                     = (known after apply)
      + user_data_replace_on_change          = false
      + vpc_security_group_ids               = (known after apply)

      + capacity_reservation_specification (known after apply)

      + cpu_options (known after apply)

      + ebs_block_device (known after apply)

      + enclave_options (known after apply)

      + ephemeral_block_device (known after apply)

      + instance_market_options (known after apply)

      + maintenance_options (known after apply)

      + metadata_options (known after apply)

      + network_interface (known after apply)

      + private_dns_name_options (known after apply)

      + root_block_device (known after apply)
    }

  # aws_instance.nat_instance must be replaced
+/- resource "aws_instance" "nat_instance" {
      ~ ami                                  = "ami-0a3f61f21fa449cda" -> "ami-0efdd6dbd49057e5b" # forces replacement
      ~ arn                                  = "arn:aws:ec2:eu-west-2:621218322544:instance/i-0ae1675a6d7b86b29" -> (known after apply)
      ~ associate_public_ip_address          = true -> (known after apply)
      ~ availability_zone                    = "eu-west-2a" -> (known after apply)
      ~ cpu_core_count                       = 1 -> (known after apply)
      ~ cpu_threads_per_core                 = 1 -> (known after apply)
      ~ disable_api_stop                     = false -> (known after apply)
      ~ disable_api_termination              = false -> (known after apply)
      ~ ebs_optimized                        = false -> (known after apply)
      + enable_primary_ipv6                  = (known after apply)
      - hibernation                          = false -> null
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      + iam_instance_profile                 = (known after apply)
      ~ id                                   = "i-0ae1675a6d7b86b29" -> (known after apply)
      ~ instance_initiated_shutdown_behavior = "stop" -> (known after apply)
      + instance_lifecycle                   = (known after apply)
      ~ instance_state                       = "running" -> (known after apply)
      ~ ipv6_address_count                   = 0 -> (known after apply)
      ~ ipv6_addresses                       = [] -> (known after apply)
      ~ monitoring                           = false -> (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      ~ placement_partition_number           = 0 -> (known after apply)
      ~ primary_network_interface_id         = "eni-06c0e462f4985c7e4" -> (known after apply)
      ~ private_dns                          = "ip-10-0-1-6.eu-west-2.compute.internal" -> (known after apply)
      ~ private_ip                           = "10.0.1.6" -> (known after apply)
      ~ public_dns                           = "ec2-18-171-106-21.eu-west-2.compute.amazonaws.com" -> (known after apply)
      ~ public_ip                            = "18.171.106.21" -> (known after apply)
      ~ secondary_private_ips                = [] -> (known after apply)
      ~ security_groups                      = [] -> (known after apply)
      + spot_instance_request_id             = (known after apply)
      ~ tags                                 = {
            "Environment" = "dev"
            "ManagedBy"   = "terraform"
            "Name"        = "rsschool-devops-nat-instance"
            "Project"     = "rsschool-devops"
          - "Task"        = "task_2" -> null
            "Type"        = "nat"
        }
      ~ tags_all                             = {
          - "Task"        = "task_2" -> null
            # (5 unchanged elements hidden)
        }
      ~ tenancy                              = "default" -> (known after apply)
      + user_data_base64                     = (known after apply)
        # (8 unchanged attributes hidden)

      ~ capacity_reservation_specification (known after apply)
      - capacity_reservation_specification {
          - capacity_reservation_preference = "open" -> null
        }

      ~ cpu_options (known after apply)
      - cpu_options {
          - core_count       = 1 -> null
          - threads_per_core = 1 -> null
            # (1 unchanged attribute hidden)
        }

      - credit_specification {
          - cpu_credits = "standard" -> null
        }

      ~ ebs_block_device (known after apply)

      ~ enclave_options (known after apply)
      - enclave_options {
          - enabled = false -> null
        }

      ~ ephemeral_block_device (known after apply)

      ~ instance_market_options (known after apply)

      ~ maintenance_options (known after apply)
      - maintenance_options {
          - auto_recovery = "default" -> null
        }

      ~ metadata_options (known after apply)
      - metadata_options {
          - http_endpoint               = "enabled" -> null
          - http_protocol_ipv6          = "disabled" -> null
          - http_put_response_hop_limit = 2 -> null
          - http_tokens                 = "required" -> null
          - instance_metadata_tags      = "disabled" -> null
        }

      ~ network_interface (known after apply)

      ~ private_dns_name_options (known after apply)
      - private_dns_name_options {
          - enable_resource_name_dns_a_record    = false -> null
          - enable_resource_name_dns_aaaa_record = false -> null
          - hostname_type                        = "ip-name" -> null
        }

      ~ root_block_device (known after apply)
      - root_block_device {
          - delete_on_termination = true -> null
          - device_name           = "/dev/xvda" -> null
          - encrypted             = false -> null
          - iops                  = 3000 -> null
          - tags                  = {} -> null
          - tags_all              = {} -> null
          - throughput            = 125 -> null
          - volume_id             = "vol-0fd9164386b76757c" -> null
          - volume_size           = 30 -> null
          - volume_type           = "gp3" -> null
            # (1 unchanged attribute hidden)
        }
    }

  # aws_internet_gateway.main will be updated in-place
  ~ resource "aws_internet_gateway" "main" {
        id       = "igw-0cdd002ca839176dd"
      ~ tags     = {
            "Environment" = "dev"
            "ManagedBy"   = "terraform"
            "Name"        = "rsschool-devops-igw"
            "Project"     = "rsschool-devops"
          - "Task"        = "task_2" -> null
        }
      ~ tags_all = {
          - "Task"        = "task_2" -> null
            # (4 unchanged elements hidden)
        }
        # (3 unchanged attributes hidden)
    }

  # aws_network_acl.private will be updated in-place
  ~ resource "aws_network_acl" "private" {
        id         = "acl-08eb00cb038bc16fc"
      ~ tags       = {
            "Environment" = "dev"
            "ManagedBy"   = "terraform"
            "Name"        = "rsschool-devops-private-nacl"
            "Project"     = "rsschool-devops"
          - "Task"        = "task_2" -> null
        }
      ~ tags_all   = {
          - "Task"        = "task_2" -> null
            # (4 unchanged elements hidden)
        }
        # (6 unchanged attributes hidden)
    }

  # aws_network_acl.public will be updated in-place
  ~ resource "aws_network_acl" "public" {
        id         = "acl-06c44615ada3eb667"
      ~ tags       = {
            "Environment" = "dev"
            "ManagedBy"   = "terraform"
            "Name"        = "rsschool-devops-public-nacl"
            "Project"     = "rsschool-devops"
          - "Task"        = "task_2" -> null
        }
      ~ tags_all   = {
          - "Task"        = "task_2" -> null
            # (4 unchanged elements hidden)
        }
        # (6 unchanged attributes hidden)
    }

  # aws_route.private_nat[0] will be updated in-place
  ~ resource "aws_route" "private_nat" {
        id                          = "r-rtb-06bf45cf8d53cce1f1080289494"
      ~ network_interface_id        = "eni-06c0e462f4985c7e4" -> (known after apply)
        # (17 unchanged attributes hidden)
    }

  # aws_route.private_nat[1] will be updated in-place
  ~ resource "aws_route" "private_nat" {
        id                          = "r-rtb-003958f3ddb40ba6a1080289494"
      ~ network_interface_id        = "eni-06c0e462f4985c7e4" -> (known after apply)
        # (17 unchanged attributes hidden)
    }

  # aws_route_table.private[0] will be updated in-place
  ~ resource "aws_route_table" "private" {
        id               = "rtb-06bf45cf8d53cce1f"
      ~ tags             = {
            "Environment" = "dev"
            "ManagedBy"   = "terraform"
            "Name"        = "rsschool-devops-private-rt-1"
            "Project"     = "rsschool-devops"
          - "Task"        = "task_2" -> null
        }
      ~ tags_all         = {
          - "Task"        = "task_2" -> null
            # (4 unchanged elements hidden)
        }
        # (5 unchanged attributes hidden)
    }

  # aws_route_table.private[1] will be updated in-place
  ~ resource "aws_route_table" "private" {
        id               = "rtb-003958f3ddb40ba6a"
      ~ tags             = {
            "Environment" = "dev"
            "ManagedBy"   = "terraform"
            "Name"        = "rsschool-devops-private-rt-2"
            "Project"     = "rsschool-devops"
          - "Task"        = "task_2" -> null
        }
      ~ tags_all         = {
          - "Task"        = "task_2" -> null
            # (4 unchanged elements hidden)
        }
        # (5 unchanged attributes hidden)
    }

  # aws_route_table.public will be updated in-place
  ~ resource "aws_route_table" "public" {
        id               = "rtb-034829311a70ba3e7"
      ~ tags             = {
            "Environment" = "dev"
            "ManagedBy"   = "terraform"
            "Name"        = "rsschool-devops-public-rt"
            "Project"     = "rsschool-devops"
          - "Task"        = "task_2" -> null
        }
      ~ tags_all         = {
          - "Task"        = "task_2" -> null
            # (4 unchanged elements hidden)
        }
        # (5 unchanged attributes hidden)
    }

  # aws_security_group.bastion will be updated in-place
  ~ resource "aws_security_group" "bastion" {
        id                     = "sg-0fec5b4cd73af2623"
        name                   = "rsschool-devops-bastion-20250621100056923800000003"
      ~ tags                   = {
            "Environment" = "dev"
            "ManagedBy"   = "terraform"
            "Name"        = "rsschool-devops-bastion-sg"
            "Project"     = "rsschool-devops"
          - "Task"        = "task_2" -> null
        }
      ~ tags_all               = {
          - "Task"        = "task_2" -> null
            # (4 unchanged elements hidden)
        }
        # (8 unchanged attributes hidden)
    }

  # aws_security_group.k3s_cluster will be created
  + resource "aws_security_group" "k3s_cluster" {
      + arn                    = (known after apply)
      + description            = "Security group for K3s cluster nodes"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "All outbound traffic"
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "10.0.0.0/16",
                ]
              + description      = "Flannel VXLAN"
              + from_port        = 8472
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "udp"
              + security_groups  = []
              + self             = false
              + to_port          = 8472
            },
          + {
              + cidr_blocks      = [
                  + "10.0.0.0/16",
                ]
              + description      = "ICMP from VPC"
              + from_port        = -1
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "icmp"
              + security_groups  = []
              + self             = false
              + to_port          = -1
            },
          + {
              + cidr_blocks      = [
                  + "10.0.0.0/16",
                ]
              + description      = "K3s metrics server"
              + from_port        = 10254
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 10254
            },
          + {
              + cidr_blocks      = [
                  + "10.0.0.0/16",
                ]
              + description      = "Kubelet API"
              + from_port        = 10250
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 10250
            },
          + {
              + cidr_blocks      = [
                  + "10.0.0.0/16",
                ]
              + description      = "Kubernetes API server"
              + from_port        = 6443
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 6443
            },
          + {
              + cidr_blocks      = [
                  + "10.0.0.0/16",
                ]
              + description      = "NodePort Services"
              + from_port        = 30000
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 32767
            },
          + {
              + cidr_blocks      = [
                  + "10.0.0.0/16",
                ]
              + description      = "etcd server client API"
              + from_port        = 2379
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 2380
            },
          + {
              + cidr_blocks      = [
                  + "10.0.0.0/16",
                ]
              + description      = "kube-controller-manager"
              + from_port        = 10252
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 10252
            },
          + {
              + cidr_blocks      = [
                  + "10.0.0.0/16",
                ]
              + description      = "kube-scheduler"
              + from_port        = 10251
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 10251
            },
          + {
              + cidr_blocks      = []
              + description      = "All UDP from cluster nodes"
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "udp"
              + security_groups  = []
              + self             = true
              + to_port          = 65535
            },
          + {
              + cidr_blocks      = []
              + description      = "All traffic from cluster nodes"
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = true
              + to_port          = 65535
            },
          + {
              + cidr_blocks      = []
              + description      = "SSH from bastion"
              + from_port        = 22
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = [
                  + "sg-0fec5b4cd73af2623",
                ]
              + self             = false
              + to_port          = 22
            },
        ]
      + name                   = (known after apply)
      + name_prefix            = "rsschool-devops-k3s-"
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Name"        = "rsschool-devops-k3s-cluster-sg"
          + "Project"     = "rsschool-devops"
        }
      + tags_all               = {
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Name"        = "rsschool-devops-k3s-cluster-sg"
          + "Project"     = "rsschool-devops"
        }
      + vpc_id                 = "vpc-03ac57bd55e6150fd"
    }

  # aws_security_group.nat_instance will be updated in-place
  ~ resource "aws_security_group" "nat_instance" {
        id                     = "sg-0b2be12c116f0d4a0"
        name                   = "rsschool-devops-nat-20250621100059915500000007"
      ~ tags                   = {
            "Environment" = "dev"
            "ManagedBy"   = "terraform"
            "Name"        = "rsschool-devops-nat-sg"
            "Project"     = "rsschool-devops"
          - "Task"        = "task_2" -> null
        }
      ~ tags_all               = {
          - "Task"        = "task_2" -> null
            # (4 unchanged elements hidden)
        }
        # (8 unchanged attributes hidden)
    }

  # aws_security_group.private_instances will be updated in-place
  ~ resource "aws_security_group" "private_instances" {
        id                     = "sg-0278d9da6609bc0fb"
        name                   = "rsschool-devops-private-20250621100059915500000006"
      ~ tags                   = {
            "Environment" = "dev"
            "ManagedBy"   = "terraform"
            "Name"        = "rsschool-devops-private-sg"
            "Project"     = "rsschool-devops"
          - "Task"        = "task_2" -> null
        }
      ~ tags_all               = {
          - "Task"        = "task_2" -> null
            # (4 unchanged elements hidden)
        }
        # (8 unchanged attributes hidden)
    }

  # aws_ssm_parameter.k3s_token will be created
  + resource "aws_ssm_parameter" "k3s_token" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + has_value_wo   = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "/k3s/node-token"
      + tags           = {
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Name"        = "rsschool-devops-k3s-token"
          + "Project"     = "rsschool-devops"
        }
      + tags_all       = {
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Name"        = "rsschool-devops-k3s-token"
          + "Project"     = "rsschool-devops"
        }
      + tier           = (known after apply)
      + type           = "SecureString"
      + value          = (sensitive value)
      + value_wo       = (write-only attribute)
      + version        = (known after apply)
    }

  # aws_subnet.private[0] will be updated in-place
  ~ resource "aws_subnet" "private" {
        id                                             = "subnet-09b742eee03db3f42"
      ~ tags                                           = {
            "Environment" = "dev"
            "ManagedBy"   = "terraform"
            "Name"        = "rsschool-devops-private-subnet-1"
            "Project"     = "rsschool-devops"
          - "Task"        = "task_2" -> null
            "Type"        = "private"
        }
      ~ tags_all                                       = {
          - "Task"        = "task_2" -> null
            # (5 unchanged elements hidden)
        }
        # (19 unchanged attributes hidden)
    }

  # aws_subnet.private[1] will be updated in-place
  ~ resource "aws_subnet" "private" {
        id                                             = "subnet-0f1ed704901363804"
      ~ tags                                           = {
            "Environment" = "dev"
            "ManagedBy"   = "terraform"
            "Name"        = "rsschool-devops-private-subnet-2"
            "Project"     = "rsschool-devops"
          - "Task"        = "task_2" -> null
            "Type"        = "private"
        }
      ~ tags_all                                       = {
          - "Task"        = "task_2" -> null
            # (5 unchanged elements hidden)
        }
        # (19 unchanged attributes hidden)
    }

  # aws_subnet.public[0] will be updated in-place
  ~ resource "aws_subnet" "public" {
        id                                             = "subnet-0c300f4bb0e6f27ca"
      ~ tags                                           = {
            "Environment" = "dev"
            "ManagedBy"   = "terraform"
            "Name"        = "rsschool-devops-public-subnet-1"
            "Project"     = "rsschool-devops"
          - "Task"        = "task_2" -> null
            "Type"        = "public"
        }
      ~ tags_all                                       = {
          - "Task"        = "task_2" -> null
            # (5 unchanged elements hidden)
        }
        # (19 unchanged attributes hidden)
    }

  # aws_subnet.public[1] will be updated in-place
  ~ resource "aws_subnet" "public" {
        id                                             = "subnet-0b010b4ff11ba6546"
      ~ tags                                           = {
            "Environment" = "dev"
            "ManagedBy"   = "terraform"
            "Name"        = "rsschool-devops-public-subnet-2"
            "Project"     = "rsschool-devops"
          - "Task"        = "task_2" -> null
            "Type"        = "public"
        }
      ~ tags_all                                       = {
          - "Task"        = "task_2" -> null
            # (5 unchanged elements hidden)
        }
        # (19 unchanged attributes hidden)
    }

  # aws_vpc.main will be updated in-place
  ~ resource "aws_vpc" "main" {
        id                                   = "vpc-03ac57bd55e6150fd"
      ~ tags                                 = {
            "Environment" = "dev"
            "ManagedBy"   = "terraform"
            "Name"        = "rsschool-devops-vpc"
            "Project"     = "rsschool-devops"
          - "Task"        = "task_2" -> null
        }
      ~ tags_all                             = {
          - "Task"        = "task_2" -> null
            # (4 unchanged elements hidden)
        }
        # (18 unchanged attributes hidden)
    }

Plan: 11 to add, 18 to change, 4 to destroy.

Changes to Outputs:
  ~ bastion_instance_id                 = "i-0348b941f375b8b68" -> (known after apply)
  ~ bastion_private_ip                  = "10.0.1.85" -> (known after apply)
  + k3s_cluster_security_group_id       = (known after apply)
  + k3s_master_instance_id              = (known after apply)
  + k3s_master_private_ip               = (known after apply)
  + k3s_worker_instance_id              = (known after apply)
  + k3s_worker_private_ip               = (known after apply)
  + kubectl_setup_commands              = {
      + bastion_ssh_command = "ssh -i rsschool-devops-key.pem ec2-user@3.11.133.167"
      + deploy_test_pod     = "Run on bastion: ./k8s-commands.sh deploy"
      + setup_on_bastion    = "ssh to bastion and run: ./setup-kubectl.sh"
      + test_cluster        = "Run on bastion: ./k8s-commands.sh test"
    }
  + local_kubectl_setup                 = {
      + copy_kubeconfig      = (known after apply)
      + port_forward_command = (known after apply)
      + usage_note           = "After copying kubeconfig, edit it to change server to https://localhost:6443 and use with KUBECONFIG=~/.kube/config-k3s kubectl get nodes"
    }
  ~ nat_instance_id                     = "i-0ae1675a6d7b86b29" -> (known after apply)
  ~ nat_instance_private_ip             = "10.0.1.6" -> (known after apply)
  ~ ssh_connection_commands             = {
      + k3s_master_via_bastion = (known after apply)
      + k3s_worker_via_bastion = (known after apply)
      ~ nat_via_bastion        = "ssh -i rsschool-devops-key.pem -J ec2-user@3.11.133.167 ec2-user@10.0.1.6" -> (known after apply)
        # (1 unchanged attribute hidden)
    }

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan"

```

</details>

*Pusher: @LordOfTheVillage, Action: `pull_request`, Workflow: `Terraform CI/CD`*